Backend/tests/performance/load.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 30
      arrivalRate: 100
      name: "Spike"
  payload:
    # We would use a CSV for generating dynamic users or tokens if needed
    # path: "users.csv"
    # fields:
    #   - "email"
    #   - "password"
  engines:
    socketio: {}

scenarios:
  - name: "Health check and static endpoints"
    weight: 7
    flow:
      - get:
          url: "/"
      - think: 1

  - name: "Socket Connection (Simulate Active Connections)"
    weight: 3
    engine: socketio
    flow:
      - emit:
          channel: "join"
          data:
            userType: "user"
            userId: "artillery-load-test-id"
      - think: 30 # hold connection open for 30 seconds